
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(Параметры.Объект, Объект);
	Обработка = РеквизитФормыВЗначение("Объект");
	
	АдресРезультатаЗапроса = Параметры.АдресРезультатаЗапроса;
	РезультатВПакете = Параметры.РезультатВПакете;
	стРезультатЗапроса = ПолучитьИзВременногоХранилища(АдресРезультатаЗапроса);
	маРезультатЗапроса = стРезультатЗапроса.Результат;
	стРезультат = маРезультатЗапроса[Число(РезультатВПакете) - 1];
	
	стрСобытиеТЖ = Обработка.ТехнологическийЖурнал_ПолучитьИнформациюПоЗапросу(стРезультат.ЗапросИД, 
	                                                                 стРезультат.ВремяНачалаЗапроса, стРезультат.ДлительностьВМиллисекундах);
	СобытиеЖурнала.УстановитьТекст(стрСобытиеТЖ);
	
КонецПроцедуры
